#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+options: author:t broken-links:nil c:nil creator:nil
#+options: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+options: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+options: timestamp:t title:t toc:t todo:t |:t
#+title: README
#+date: <2021-11-21 Sun>
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 27.2 (Org mode 9.5)
#+cite_export:
* Usage Examples
#+begin_src python :session :exports both :results raw drawer
  import numpy as np
  import pandas as pd
  import matplotlib.pyplot as plt
  from spyglass.EDA import boilerfig, activeannots
#+end_src

#+RESULTS:
:results:
:end:
* Ideally:
#+begin_src python :session :exports both :results raw drawer
  import numpy as np
  import pandas as pd
  import matplotlib.pyplot as plt
  import spyglass.EDA

  ieda = spyglass.EDA.boilerplate

  xy = np.random.random((10,2))
  labels = ["Label for instance #{0}".format(i) for i in np.arange(xy.shape[0])]

  fig, ax = plt.subplots(1,1, FigureClass=ieda, subplot_kw={'projection':'interactive'})
  fig.add_button()
  ax.activescatter(xy[:,0], xy[:,1], labels)

  plt.show()
#+end_src

#+RESULTS:
:results:
None
:end:

#+begin_src python :session
import matplotlib.pyplot as plt
from matplotlib.widgets import Button

class ButtonClickProcessor(object):
    def __init__(self, axes, label):
        self.button = Button(axes, label)
        self.button.on_clicked(self.process)

    def process(self, event):
        print(self.button.label)

fig = plt.figure()

axnext = plt.axes([0.81, 0.05, 0.1, 0.075])
bnext = ButtonClickProcessor(axnext, "Next")

plt.show()
#+end_src

#+RESULTS:
: None

